<?php

/**
 * Only translate these if World of Warcraft does it themselves,
 * otherwise you'll confuse people who expect to see them in English
 * Don't touch the null-entries, they are just there to avoid errors
 */

$lang['speed'] = "攻击速度";

$lang["bind"] = array(
    0 => null,
    1 => "拾取后绑定",
    2 => "装备后绑定",
    3 => "使用后绑定",
    4 => "任务物品"
);

$lang["slots"] = array(
    0 => null,
    1 => "头部",
    2 => "颈部",
    3 => "肩部",
    4 => "衬衣",
    5 => "胸部",
    6 => "腰部",
    7 => "腿部",
    8 => "脚部",
    9 => "手腕",
    10 => "手部",
    11 => "手指",
    12 => "饰品",
    13 => "单手",
    14 => "盾牌",
    15 => "远程",
    16 => "背部",
    17 => "双手",
    18 => "容器",
    19 => "战袍",
    20 => "长袍",
    21 => "主手",
    22 => "副手",
    23 => "可持物",
    24 => "弹药",
    25 => "投掷",
    26 => "远程",
    27 => "箭袋",
    28 => "圣物"
);

$lang["damages"] = array(
    0 => "物理伤害",
    1 => "神圣伤害",
    2 => "火焰伤害",
    3 => "自然伤害",
    4 => "冰霜伤害",
    5 => "暗影伤害",
    6 => "奥术伤害"
);

$lang["spelltriggers"] = array(
    0 => "使用: ",
    1 => "装备: ",
    2 => "命中时: ",
    3 => "未知: ",
    4 => "未知: ",
    5 => "未知: ",
    6 => "未知: "
);

$lang["armor_sub"] = array(
    0 => "杂项",
    1 =>  "布甲",
    2 => "皮甲",
    3 => "锁甲",
    4 => "板甲",
    5 => null,
    6 => " 盾牌",
    7 => "圣契",
    8 => "神像",
    9 =>  "图腾",
    10 => " 魔印",
);

$lang["weapon_sub"] = array(
    0 => "斧头",
    1 => "斧头",
    2 => "弓",
    3 => "枪",
    4 => "锤",
    5 => "锤",
    6 => "长柄武器",
    7 => "剑",
    8 => "剑",
    9 => "过时",
    10 => "法杖",
    11 => "异种",
    12 => "异种",
    13 => "拳套",
    14 => "杂项",
    15 => "匕首",
    16 => "投掷",
    17 => "长矛",
    18 => "弩",
    19 => "魔杖",
    20 => "鱼竿"
);

$lang["stats"] = array(
    0 => "法力",
    1 => "生命",
    3 => "敏捷",
    4 => "力量",
    5 => "智力",
    6 => "精神",
    7 => "耐力",
    12 => "防御等级 ",
    13 => "闪避等级 ",
    14 => "招架等级 ",
    15 => "格挡等级 ",
    16 => "近战命中等级 ",
    17 => "远程命中等级 ",
    18 => "法术命中等级 ",
    19 => "近战暴击等级 ",
    20 => "远程暴击等级 ",
    21 => "法术暴击等级 ",
    28 => "近战急速等级 ",
    29 => "远程急速等级 ",
    30 => "法术急速等级 ",
    31 => "命中等级 ",
    32 => "暴击等级 ",
    35 => "韧性等级 ",
    36 => "急速等级 ",
    37 => "精准等级 ",
    38 => "攻击强度 ",
    39 => "远程攻击强度 ",
    40 => "野性攻击强度",
    41 => "治疗 ",
    42 => "法术伤害 ",
    43 => "每5秒法力值回复 ",
    44 => "护甲穿透等级 ",
    45 => "法术强度 ",
    46 => "每5秒生命值回复 ",
    47 => "法术穿透等级 ",
    48 => "格挡值 ",
);
