<?php

namespace App\Config;

use CodeIgniter\Config\BaseConfig;

class App extends BaseConfig
{
    /**
     * 允许的站点URL中的主机名，除了baseURL中的主机名之外。
     * 如果您希望接受多个主机名，请设置此项。
     *
     * 例如，
     * 当您的站点URL（base_url()）是'http://example.com/'，并且您的站点
     * 还接受'http://media.example.com/'和'http://accounts.example.com/':
     *     ['media.example.com', 'accounts.example.com']
     *
     * @var list<string>
     */
    public array $allowedHostnames = [];

    /**
     * --------------------------------------------------------------------------
     * 索引文件
     * --------------------------------------------------------------------------
     *
     * 通常，这将是您的`index.php`文件，除非您已将其重命名为其他名称。如果您已配置Web服务器以从站点URI中删除此文件，请将此变量设置为空字符串。
     */
    public string $indexPage = 'index.php';

    /**
     * --------------------------------------------------------------------------
     * URI协议
     * --------------------------------------------------------------------------
     *
     * 此项目确定应使用哪个服务器全局变量来检索URI字符串。默认设置'REQUEST_URI'适用于大多数服务器。
     * 如果您的链接似乎不起作用，请尝试其他美味的选项：
     *
     *  'REQUEST_URI': 使用$_SERVER['REQUEST_URI']
     * 'QUERY_STRING': 使用$_SERVER['QUERY_STRING']
     *    'PATH_INFO': 使用$_SERVER['PATH_INFO']
     *
     * 警告：如果将此设置为'PATH_INFO'，URI将始终被URL解码！
     */
    public string $uriProtocol = 'REQUEST_URI';

    /*
    |--------------------------------------------------------------------------
    | 允许的URL字符
    |--------------------------------------------------------------------------
    |
    | 这允许您指定URL中允许的字符。当有人尝试提交包含不允许字符的URL时，他们将
    | 收到警告消息。
    |
    | 作为安全措施，强烈建议您将URL限制为尽可能少的字符。
    |
    | 默认情况下，只允许这些字符：`a-z 0-9~%.:_-`
    |
    | 设置为空字符串以允许所有字符 - 但只有在您疯狂的情况下。
    |
    | 配置的值实际上是一个正则表达式字符组
    | 它将被用作：'/\A[<permittedURIChars>]+\z/iu'
    |
    | 不要更改此设置，除非您完全理解其后果！
    |
    */
    public string $permittedURIChars = 'a-z 0-9~%.:_\-';

    /**
     * --------------------------------------------------------------------------
     * 默认区域设置
     * --------------------------------------------------------------------------
     *
     * 区域设置大致代表访问者查看站点的语言和位置。它会影响语言字符串和其他
     * 字符串（如货币标记，数字等），您的程序应在此请求下运行。
     */
    public string $defaultLocale = 'cn';

    /**
     * --------------------------------------------------------------------------
     * 协商区域设置
     * --------------------------------------------------------------------------
     *
     * 如果为true，当前请求对象将根据Accept-Language标头的值自动确定
     * 要使用的语言。
     *
     * 如果为false，将不会执行自动检测。
     */
    public bool $negotiateLocale = false;

    /**
     * --------------------------------------------------------------------------
     * 支持的区域设置
     * --------------------------------------------------------------------------
     *
     * 如果$negotiateLocale为true，此数组列出了应用程序支持的区域设置，
     * 按优先级降序排列。如果未找到匹配项，将使用第一个区域设置。
     *
     * IncomingRequest::setLocale()也使用此列表。
     *
     * @var list<string>
     */
    public array $supportedLocales = ['cn'];

    /**
     * --------------------------------------------------------------------------
     * 应用程序时区
     * --------------------------------------------------------------------------
     *
     * 这是应用程序中用于显示日期的默认时区，
     * 可以通过app_timezone()函数获取。
     *
     * @see https://www.php.net/manual/en/timezones.php 以获取PHP支持的时区列表。
     */
    public string $appTimezone = 'UTC';

    /**
     * --------------------------------------------------------------------------
     * 默认字符集
     * --------------------------------------------------------------------------
     *
     * 这确定了在各种需要提供字符集的方法中默认使用的字符集。
     *
     * @see http://php.net/htmlspecialchars 以获取支持的字符集列表。
     */
    public string $charset = 'UTF-8';

    /**
     * --------------------------------------------------------------------------
     * 强制全局安全请求
     * --------------------------------------------------------------------------
     *
     * 如果为true，这将强制对该应用程序的每个请求都通过安全连接（HTTPS）进行。如果传入的请求不安全，用户将被重定向到安全版本的页面，并且将设置HTTP严格传输安全（HSTS）标头。
     */
    public bool $forceGlobalSecureRequests = false;

    /**
     * --------------------------------------------------------------------------
     * 反向代理IP
     * --------------------------------------------------------------------------
     *
     * 如果您的服务器位于反向代理之后，您必须将代理的IP地址列入白名单，以便CodeIgniter能够信任诸如X-Forwarded-For或Client-IP之类的标头，从而正确识别访问者的IP地址。
     *
     * 您需要设置代理的IP地址或子网以及客户端IP地址的HTTP标头。
     *
     * 以下是一些示例：
     *     [
     *         '10.0.1.200'     => 'X-Forwarded-For',
     *         '192.168.5.0/24' => 'X-Real-IP',
     *     ]
     *
     * @var array<string, string>
     */
    public array $proxyIPs = [];

    /**
     * --------------------------------------------------------------------------
     * 内容安全策略
     * --------------------------------------------------------------------------
     *
     * 启用响应的内容安全策略，以限制可用于图像、脚本、CSS文件、音频、视频等的来源。如果启用，响应对象将从`ContentSecurityPolicy.php`文件中填充策略的默认值。控制器可以在运行时随时添加这些限制。
     *
     * 为了更好地理解CSP，请参阅以下文档：
     *
     * @see http://www.html5rocks.com/en/tutorials/security/content-security-policy/
     * @see http://www.w3.org/TR/CSP/
     */
    public bool $CSPEnabled = true;
}
